app/controllers/clubs_controller.rb

    def index
        clubs = Club.all
---
SELECT "clubs".* FROM "clubs"

    def show
        club = Club.find(params[:id])
---
SELECT "clubs".* FROM "clubs" WHERE "clubs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def create
        club = Club.create!(club_params)
        if club.save
            movie = Movie.find_by(id: params[:movies][:id])
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

    def destroy
        club = Club.find(params[:id])
---
SELECT "clubs".* FROM "clubs" WHERE "clubs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]