app/controllers/clubs_controller.rb

    def find_club
        club = Club.find(params[:id])
---
SELECT "clubs".* FROM "clubs" WHERE "clubs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]