app/controllers/movies_controller.rb

    def index
        movies = Movie.all;
---
SELECT "movies".* FROM "movies"

    def show
        movie = Movie.find(params[:id])
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]